# Замыкание (Closure)
# Замыкание (Closure)- функция которая находится внутри другой функции и ссылается на 
# переменые обявление в теле внешней функции (свободнные переменные) 

# def main_func():
#     name = 'Carnell'
#     def inner():
#         return('Hello',name)

#     return inner()

# print(main_func())


# в данном пример есть локальная и глобальная область видмость так же присутствует 
# внешнная и вложенная функция 
# Переменная name отсуствует в локальная области , но программа выдаст резултат без
# исключени , переменная name найдется в глобалной.
#  ее области видмости, так вот замыканием называется такаяситуатция когда  
# вложнная функция пользуется переменнами которые не обявлены 
#   В ее теле !

# Бул замыкание деп биз (Глобалныйдагы функцияны Локолныйга чакырсак ) бул (Замыкание деп аталат)
# МИсалы: Глобалныйдагы функция Локолныйга чакырсак иштеп жатса анда ал (Замыкание) 



