# Конкатенация аркылу суйлом тузу

# naem='Azatbek'
# age='21'
# print('Салам достор менин атым'+ naem,'мен'+ age,'жаштамын')


# Тема: format()
# format- бул Python  тилинде конкатенацияга замена деп тушунсок болот.
# Бирок айырмасы format- биз жазган код тарабын окуулусун жана жондомун жогорулатат

# 1)
# naem='Азатбек'
# age ='21'
# d='2001'
# print('Салам достор менин атым {0} мен {1} жаштамын мен {2} болом'.format(naem,age,d))


# 2- экинчи варианты
# name = 'Aскар'
# age = '24'
# print('Cалам менин атым {full} мен {old} жаштамын' . format(full=name, old=age))


# 3- учунчу варианты
# name = 'Aскар'
# age = '24'
# print (f'Cалам менин атым {name} мен {age} жаштамын')

# neam='Azatbek'
# age='21'
# print(f'Менин атым {neam} мен {age} жаштамын')


# Конкатенация бул эки же андан коп (сроканы кошуп салат)

