# Тема: Файлдар менен иштоо

# Папка менен ишто командасы
# 1) Clear - Бул команда терминалды тазалоо кызматын аткарат 
# 2) ls - Бул команда кайсыл файлда турганынды текшерет 
# 3) cd - Бул команда биринчи папкадан экинчи папкага отуу кызматын аткарат 
# 4) cd.. - бул команда папкадан чыгуу кызматын аткарат
# 5) mkadir же md - папка ачуу кызматын аткарат 
# 6) rmdir же rd - папканы очуруу кызматын аткарат 
# 7) tree - Папканын бутагын кароо кызматын аткарат


# Файл менен иштоо командасы 
# 1) del же erase - файылды жок кылуу командасы..
# 2) ren же rename - Файлдын атын озгорту командасы
# 3) tasklist - иштеп жаткан процессор 
# 4) help - Жардам командасы (Справка)
# 5) touch же echo - Файл ачуу командасын аткарат





