# Тема: Шартуу операторлор (условные операторы)
# if elif else

# (if) англист тилинен алынганда (эсли) деп которулат ал эми (elif иначе) деп 
# Python праграмалоо тили проста интерперетаторго айтат определенный код участогу аткарабы же жокпу деп!

# > Больше
# < Меньше
# >= Больше или равно
# <= Меньше или равно
# >> Ccдвиг в право 
# << Ссдвиг в лево
# != Не равно 

# 1) if

# test=int(input("Введите свой бал:"))
# if test <=80:
#     print("Вы не прошли сесию!")
# elif test>=80:
#         print("Вы прошли сесию поздравляем")
# else:
#     print("Программа заверщена")


# 2)  and(и)

# m=int(input("Введите оценку студента"))
# if m >= 4 and 5:
#     print("отлично")
# elif m <= 3 and 2:
#     print("Плохо")


# 3) Boolean type (True,False)

# Праграмиравание тилинде (Ture ду 1ге салыштырат) ал эми (Fals ты 0 нолго салыштырат)
# Ture бул правда болгондуктан бирге барабар. Ал эми False пустата болгондуктан 0 нолго барабар.


# 4) Оператор (not) Python тилтнде (колундарный логический ) оператор деп койсок болот бул 
# (not) Правданы-Ложьго , Ложьду-Правдага айландырат


# Ture = False
# False = Ture

# a = 2
# b = 0
# print(not a)
# print(not b)



# test=int(input('Ведите свой бал'))
# if test < 50:
#     print('Вы не прошли сесию')
# elif test >=50:
#     print('Поздравляем вы прошли сесию')





