# Анонимная функция (лямбда-выражение)
# В Python лямбда-выражение позволяет создоваать анонимные функци- функци
# которые не привязаны к имены.
# Синтаксис у неге следущии
# lambda apri, арг2,... : выражение
# В анонимной функции:

# 1)
# Python лямбда туйунтмасы аттарга байланбаган анонимдуу функцияларды тузууго мумкундук берет


#       может содержаться только одно выражение
#       могут передаваться сколько уугодно аргументов


# #Обычная функция:
# def sum (a, b):
#     return a + b

# print(sum(1,3))

# #Аналогичная функция, но с использованием лямбда-функции:
# s = lambda a, b: a + b
# print(s(1, 2))

# мисалы:
# k= lambda d,f:d+f
# print(k(4,4))



