#  Метод списков 

# # # 1)  Метод append () - Бул метод списоктун аягына элемент кошот 
# ls =[123, 'hello' , 34]
# ls.append (78)
# print (ls)

# 2) Метод clear() - Бул метод списоктун элементерин жок кылат!
# ls2 =['hi',90,78]
# # ls2 . clear()
# print(ls2)

# 3) Метод copy() Бул метод списоктун элементерин копия кылат 
# ls3 = [56, 45]
# b = ls3.copy()
# print(ls3)

# 4) Метод insert()- Бул метод биз жазган индекске элемент кошуп салат!
# ls4 = ['welcom', 89, 9]
# ls4.insert(0, 'hello')
# print(ls4)

# 5) Метод index()- Бул метод индексин бизге чыгарып берет (Эскерту элемент жазылат)
# ls5 = [34,56]
# print(ls5.index(34))

# 6) Метод sorted()- Бул метод списокту сортировка кылат!
# ls6 = [45,67,989,56]
#print(sorted(ls6))

# 7) Метод count()- Бул метод списoкто канча окшош элемент бар экенин аныктайт!
# ls7 = [78,78,89,67]
# print(ls7.count(78))

# 8) Метод  len()- Бул метод списокто канча элемент бар экенин аныктайт !
# a = ['hi',45,'world']
# print(len(a)) 

