#  Тема: список англ. [list]
# списоки Python это упорядочные и изминяемые колекцци 
# проивольных обектов

# в  Python список обазначается квадратными скобками []


# пустой список жарату жолдору !
# 1) а = []
# 2) list =[б]

# Список озуно баардык тип малыматы (тип даных) сактайт!
# = [1234, 45.6, "hello", True]  

# Срезы списков !
# срез бул- кайсы бир маалымат тип (тип данных) ичинде бизге керектуу элементти
#алуу учун срез деп айтсак болот .
# Мындайча айтканда срездин жардамы менен бизге керекту элементи алабыз !
# list = [2, 3, 4, 5]
# print(list [2])

# Списоктун функциялары:
# 1 Копия 

# s = ['mir','world']
# print(s)
# d = list(s)
# print(d)


#  2) max жана min функциялары
# ns = [123, 45, 56, 78, 90]
# print(max(ns))
 

 # min 
# nb = [234,43, 22, 65]
# print(min(nb))

# 3) sun функциясы
# list = [34,968,788]
# print(sum(list))

# 4) sorted-функциясы!
# ls = [12,45, 34, 89]
# print(sorted(ls))


#  Cписоктун операторлору 
#  Операторлор *  дубликат жумушун аткарат!

# os = ['Python']
# print(os * 5)


# Оператор in
# Оператор (in) списокто кайсы бир элемент бардыгын же жоктугун аныктайт !

# s = ["Pyton", 'Jsva',45]
# print(45 in s)


# Оператор + кошуу кызматын аткарат 

# ls = [1,2,3] + [4,5,6]
# print[ls]


