# Тема:математикалык операциялар жана операторлор

# 1, 2, 3, 4, 5, булар жонокой сандар (python) тилинде инт деп айтылат

# 12.4 , 10.6 , 34.7 болчок сандар (python) тилинде float деп айтабыз



#1
#тема print/ строка 
# n = 12
# b = 14
# print (n, b, sep='-') # sep- бул print'тин аргументи 
# (Бул аргумент разделитель деп аталат жана озун спец синволдор менен озун камтыйт !)

# 2)
# s='sky'
# f='sun'
# print(s,f, end=" ")
# print('world') # Экинчи аргумент бул (end.) 
# #строчканы бир болуко айландрат ! 

# Python средасына кириш учун биз (python же python3)
 # деп жазабыз !
 # Ал эми чыгыш учун (ctrl + z же quit) командасы менен чыгабыз! 



 # строка!(str)
 # строка бул тамга ырааттуулугу, ал ковычканын ичине жазылат, мисалы ""
 # Cтроко бул ирээтелген (упорядочный ) ,  жана озгорбоочу (неизменяемый) тип деп атайбыз !
 # Эгерде сиз  Python тилинде ковычкада (цифрабы же соз) коросузбу бул топтом деп айтылат!
 
#Бул + строкада кошуу кызматын аткарат
# name = 7
# name2 = 23
# print(name + name2)


# Бул * жылдызча строкада кобойту кызматын аткарат
# j = 5
# print ( j * 10)

# Бул \t алдыга торт жолу жылдыру кызматын аткарат
# Бул \n кийинки строчкага жылдыру кызматын аткарат
# print(lanq) #\n - бул кийинки строчкага перевод кылып салат . 



# fruits = ["apple", "banana", "cherry"]
# for x in fruits:
#   print(x)
#   if x == "banana":
#     break




