# Тема область видимости переменных

# 1)
# name = 'Toms' #Бул функция озу (Глобалный) биз аны баардык жерден чакыра алабыз

# 2) 
# def func():
#     text = 'Салам'# Ал эми функциянын ичинде жазылган переменый бул (Локалный деп аталат) 
#     print(text)   # Биз аны баардык жерден чакыра албайбыз 

# func()

# # 3) global Бул (локалныйды - глобальныйга айландырат)
# def ins():
#     global text
#     text = 'Салам' 
#     print(text)


# ins()

# print(text)

# def aza():
#     global d
#     d = 'hollo'
#     print(d)

# aza()

# print(d)

