# Тема: Множества!
# Множестова бул Python праграммало тилинде озгоруучу жана упорядочный типке кирбеген 
# уникалдуу коллекция типттери!
# Множествада элементтер кайталанбайт, радомный порядка журот 
# Cловарь менен множестванын айырмасы, биз словарьда ачкыч жана маани берсек ал эми 
# Множествада жонокой эле мааниде жазылат !

# Пустой set жаратуу жолдору 
# # 1)
# set={1,}
# print(set)


# Айырмасы (set) менен (dect)тин {} скопкалары окшош пустой список жаратканда айырмасын байкайлы!

# Мисалы set
# n ={1}
# print(type(n))

# Пустой список жаратканда эко окшош болуп калат ошон учун (сан жана утур койуш керек set ке)

# словарь dict
# f = {}
# print(type(f))

# Множестванын операторлору жана методдору!
# Oператор in бул ушундай соз же сан барбы же жокпу аныктайт
# s = {1,2,3,4}
# print( 3 in s)


# Метод add()-бул метод словарьга элемент кошуу кызматын аткарат!
# set = {123,'world',78}
# set.add('hello')
# print(set)


# Метод discard()- бул метод словардагы элементти жок кылат !
# set = {1,3,4,6}
# set.discard(3)
# print(set)

# Метод clear()- бул метод словардагы элементтерди баарын алып салат!
# set ={ 45,'we','on',67}
# set.clear()
# print(set)

# Метод update()-бул метод словарьга элемент кошуу кызматын аткарат!
# set = {123,'world',78}
# set.update('hello')
# print(set)


# Метод len()-бул метод словарьда канча элемент бар экенин аныктайт!
# set = {12,14}
# print(len(set))


       # МНожестванын кеслиши(sets)
# a = {1,2,3}
# d = {4,5,6}
# print(a & d)

# Множестванын кошулушу (sets)
# a = {1, 2, 3}
# d = {4, 5, 6}
# print(a | d)

#Множестванын кемитуусу
# a = {1,2,3,4}
# b = {3,4,5,6}
# print(a - b)









