# Тема: Cловар(diсt)
# Python тили ар кандай маалыматарды сактоочу жана структураларга ээ тил 
# Словар - ачкыч жана жуп форматында маалыматарды сактаган структуралардын бири (тип данных)
# Биз мындайча айтканда ачкычтарды колдонуп маанисин чыгарып алабыз!
# ключу неизменяемый типке кириш керек!!!
# Эмнеге дегенде ключу эч качан озгорбойт

# str - (Строка) ()
# int - (Жонокой сан)
# float - (Болчок сан)
# list - (Список) []
# dict - (Словар) чи{}
# Boolean Type - (Frue,false)


# Пустой словарь жарату жолдору:
# 1)
# dict = {}
# print(dict)


# Список менен словардын айырмасы 
# d = {'One':1}

# list=[12,15,'hi',23,34,True]


# Словарьдын функциялары!
# Словарьды озгортуу жолу (мааниси!!!)

# dict = {'marka':1,"year" :2019}
# dict['year']=2021
# print(dict)

#Словарь 
# dict = {'marka':1,"year" :2019}
# del dict['year']
# print(dict)

# Словарь методдору!
# Метод len () - Словарьда канча маани бар экенин аныктап берет!
# d = {1: 'one',2:'rwo'}
# print(len(d)) 


#Метод Keys()- Бул метод словарьда канча ключ бар экенин аныктайт!
# dict = {'Macbook': "Pro",'Macbook': 'Air'}
# dict2 = dict.keys()
# print(dict2)


#Метод copy()- Бул метод словарьды копия кылат!
# d = {1:89,2:90}
# c = d.copy()
# print(c)



