# Тема: строкалардын методу!
# Метод бул функция катары кабыл алсак болот , ал строка же конкретный обьекте колдонулат !
# Эгерде сиз метод чакырсаныз эске алыныз строка бул озгорбочу типке кирерин ,
# мындайча айтканда эгер строкадагы элементтерди жок кылгыбыз келсе , оргиралга тийбей 
# бийбей бизге жаны строка чыгарып берет!
 
#1)  Метод title ()- бул метод баштапкы жазылган тамгасын чон кылып чыгарат !

# ns ='dreak'
# print(ns.title())

# s = input ("Введите свое имя:")
# print(s.title())

# # 2) Метод upper() - бул метод суйломдордун баарын чон тамга кылып чыгарат!
# name 
# ns= "Tom"
# print(ns.upper())

# #3) Метод  Lower() - Бул метод бардык суйломду кичинекей тамга кылып чыгарат !

# name = "TOM"
# print(name.lower())


#4) Метод find() - бул метод суйломдун индекисин чыгарып берет !

# name = 'Azat'
# print(name.find('t'))

# #5) - Метод  replace () -  бул метод менен строкадагы (суйломдун) тамгаларды озгортсок болот !

# name = 'Harby'
# print (name.replace("b" , "z" ))

# #6) Метод count() - бул метод строкада канча окшош тамга бар экенин аныктап берет!

# # s = 'abrakadabra'
# print(s.count('ra'))

# #7) метод index() -  бул методт find () метод менен окшош эле , эгерде метод find да 
# туура эмес тамга берсек ал жумушун аткара берет ал эми index  болсо бизге ошибка чыгарат!

# name = "TOM"
# print(name.index('k')) 

# 8) Метод isalpha() - бул метод строка тамгадан турабы же жокпппобу бизге аныктап берет !

# n = 'Hi'
# print(n.isalpha())

# True - Бул чындык (Правда)
# False - Бул жалган (Ложь)



# #9)  Метод isdigit() - бул метод строка цифрадан турабы же жокпу бизге аныктап берет!
# n = '123'
# print(n.isdigit())


# 10)  Метод  split() -  бул метод строканы строкага болот !

# s = 'Привет я Back-end  разработчик'
# print(s.split(' '))






