# Тема:Кортеж (tuple)
#Кортеж бул ирээтелген жана озгорулусуз маалыматар жыйынына кирген тип данных!
# Кортеждер өзгөрүлгүс маалымат структуралары. Список сыяктуу эле, алар үтүр менен
# бөлүнгөн ар кандай типтеги элементтерден турушу мүмкүн. 
# Кортеждер төрт бурчтуу кашаага эмес, тегерек кашаага алынат.
#      Жана кортеж бат иштейт жана анын  зашитасы кучтуурак мисалы колдонучу поролду алмаштырбаса 
# эчким алмаштыра албайт
# Пустой кортеж жарату жолдору:


# 1)
# tuple()
# print(tuple)


# 2)
# a = ()
#print(a)

# tuple = ('a',)
# print(tuple)


# 3)
# 3,4,5
# x,y,z=(3,4,5)
# print(x,y,z)

# a,t,d =(3,5,40)
# print(3*5+40)




