# Тема:Цикл (Loops)
# Цикл while Pythonдо белгилуу бир билдирууну кайра-кайра аткару учун колдонулат,
# эгерде берилген шарт чын болсо - Ture

# while бул (пока) деп которулат

# Мисалы:
# 1)
# Чексис Цикл (Без конечный цикл).
# Чексиз цикл шарты эч  качан жалган болуп калбаган цикл.
# Бул деген кайра-кайра аткарылат жана цикл эч качан бутпойт дегенди билдирет.

# Томонку мисалдар чексиз циклдер:

# a = 1 
# while a == 1:
#     b = input('Сенин атын ким ')
#     print('Салам', b, 'кош келипсин!!!')



  # 2)
# a = 1 
# while 1 == 1:
#     print(a)
#     a +=1
    # break
    
# # Оператор continue жана break.
# Оператор break досрочно циклды  токтотот.
# Оператор continue бул циклды улантууга жондомду.



# whileа эмес') 6:
#   d = int (input('Кыргызстан канча олко менен чектеш?'))
# if d == 4:
#             print('туура')
# elif d >4:
#             print('Туур

# 3) for in цикл 

# elems = [1,2,3,4,5,6,7,8,9]
# for i in elems:
#   print(i)


# 4) (range) Фунукциясфы

# for p in range(0,100):
#   print(p)

# a = 4
# while a == 4:
#   s = input("")
#   print(s)



